### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [27]:
#импортируем данные
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [31]:
# фильтрую данные по условию, что рейтинг равен 5
# группирую по фильму и считаю количество фильмов в каждой группе
# сортирую по убыванию по любому из столбцов: userIdб rating, timestamp. Выбрала столбец reting.

ratings.query('rating == 5').groupby('movieId').count().sort_values('rating', ascending = False).head()

         userId  rating  timestamp
movieId
318         153     153        153
296         123     123        123
356         116     116        116
2571        109     109        109
260         104     104        104

In [32]:
# ВАРИАНТ 2. Вначале выбираю только те столбцы, по которым буду группировать 
# фильтрую данные по условию, что рейтинг равен 5
# группирую по фильму и считаю количество фильмов в каждой группе
# сортирую по убыванию по столбецe reting.
 
rat_filter = ratings[['movieId','rating']]
rat_filter.query('rating == 5').groupby('movieId').count().sort_values('rating', ascending = False).head()

         rating
movieId
318         153
296         123
356         116
2571        109
260         104

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [33]:
#импортируем данные
data = pd.read_csv('database/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [40]:
#найдем как называются страны Прибалтики ( Latvia, Lithuania, Estonia, Baltic country)
#выводим весь список уникальных значений стран
#data['country'].unique()

In [37]:
# ищем написание стран (сделала для пробы)
data[data ['country'].str.contains('ia', case = False)]['country'].unique()

array(['Austria', 'Czechia', 'Romania', 'Serbia', 'Slovakia', 'Bulgaria',
       'Croatia', 'Lithuania', 'Other Asia', 'T.F.Yug.Rep. Macedonia',
       'Colombia', 'Australia', 'Ethiopia', 'Serbia and Montenegro',
       'Tunisia', 'Georgia', 'Latvia', 'Armenia', 'Russian Federation',
       'Bolivia (Plur. State of)', 'Estonia', 'Ethiopia, incl. Eritrea',
       'French Guiana', 'Indonesia', 'Liberia', 'Malaysia', 'Mauritania',
       'Namibia', 'New Caledonia', 'Slovenia', 'United Rep. of Tanzania',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria',
       'French Polynesia', 'Syrian Arab Republic', 'India', 'Nigeria',
       'Somalia', 'Albania', 'Bosnia and Herzegovina',
       'Czechoslovakia (former)', 'Equatorial Guinea', 'Saudi Arabia',
       'St. Lucia', 'Mongolia', 'Cambodia', 'Gambia',
       'Micronesia (Fed. States of)', 'Northern Mariana Islands'],
      dtype=object)

In [61]:
# создаем новый df отфильтрованный по нужным странам (условие или)
data_country = data[ (data['country'] == 'Latvia') | (data['country'] == 'Lithuania') | (data['country'] == 'Estonia')]
data_country.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [76]:
#фильтрую данные по году (с 2005 по 2010 года.)
#фильтрую данные по категориям (4,12 и 21)
#суммируем все значения столбца quantity, если показатель не отрицательный
data_country.query('2010 >= year >= 2005').query('category == 4' or'category == 12' or'category == 21' ).query('quantity >= 0')['quantity'].sum()

46.0

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [31]:
page_url1 = 'https://smart-lab.ru/q/shares/'
df = pd.read_html(page_url1, attrs = {'class': 'simple-little-table trades-table'}, encoding='utf-8')

In [36]:
df[:5]

[         № Unnamed: 1     Название  Тикер  Unnamed: 4  Unnamed: 5  Unnamed: 6  \
 0      NaN   18:51:01  Индекс ММВБ  IMOEX         NaN         NaN         NaN
 1      1.0   18:45:56     Сбербанк   SBER         NaN         NaN         NaN
 2      2.0   18:45:46   ГАЗПРОМ ао   GAZP         NaN         NaN         NaN
 3      3.0   18:45:36    ГМКНорНик   GMKN         NaN         NaN         NaN
 4      4.0   18:45:24       ЛУКОЙЛ   LKOH         NaN         NaN         NaN
 ..     ...        ...          ...    ...         ...         ...         ...
 277  277.0   18:40:05      КЗМС ао   KZMS         NaN         NaN         NaN
 278  278.0   18:40:05    ГАЗКОН-ао   GAZC         NaN         NaN         NaN
 279  279.0   18:40:02    ТрансК ао   TRCN         NaN         NaN         NaN
 280  280.0   18:40:05    КУЗОЦМ ао   KUNF         NaN         NaN         NaN
 281  281.0   18:40:05      Кокс ао   KSGR         NaN         NaN         NaN

      Цена, посл  Изм, % Объем, млн руб 1 нед, %  1 м, %  ytd, %  12м, %  \
 0       3598.44  +0.84%      86 066.82    +3.2%   +2.7%   +9.4%  +42.0%
 1        289.03  +1.87%      17 435.31    +3.0%   +2.2%   +6.6%  +50.4%
 2        235.02  +0.17%      10 473.77    +6.0%   +3.2%  +10.5%  +27.0%
 3      25500.00  +1.55%       8 226.23    +4.3%  +11.9%   +7.4%  +28.9%
 4       6062.50  +0.13%       4 424.85    +2.1%   -2.2%  +17.0%  +30.9%
 ..          ...     ...            ...      ...     ...     ...     ...
 277         NaN      0%            NaN      NaN     NaN     NaN     NaN
 278         NaN      0%            NaN      NaN     NaN     NaN     NaN
 279         NaN      0%            NaN      NaN     NaN     NaN     NaN
 280         NaN      0%            NaN      NaN     NaN     NaN     NaN
 281         NaN      0%            NaN      NaN     NaN     NaN     NaN

     Капит-я млрд руб  Капит-я млрд $ ИзмОбъема Изм позпо Объему Unnamed: 18  \
 0          58 381.97          772.72      -12%                —           —
 1           6 513.83           86.21      -25%              NaN           +
 2           5 563.75           73.64      -20%              NaN           +
 3           4 035.26           53.41      -19%              NaN           +
 4           4 200.50           55.60      -28%              NaN           +
 ..               ...             ...       ...              ...         ...
 277             0.20            0.00       NaN              NaN           +
 278            58.96            0.78       NaN              NaN           +
 279           119.43            1.58       NaN              NaN           +
 280              NaN             NaN       NaN              NaN           +
 281              NaN             NaN       NaN              NaN           +

     Unnamed: 19
 0             —
 1             +
 2             +
 3             +
 4             +
 ..          ...
 277           +
 278           +
 279           +
 280           +
 281           +

 [282 rows x 20 columns]]

In [16]:
page_url = 'https://www.finanz.ru/'
df1 = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [27]:
df1[3]

       Имя  Unnamed: 1     %     курс                 Дата
0  EUR/RUB         NaN -5824    90893  17.04.2021 00:32:00
1  USD/RUB         NaN -8424    75801  17.04.2021 00:00:00
2  CHF/RUB         NaN   254   823835  17.04.2021 06:07:00
3  JPY/RUB         NaN  2263     6966  17.04.2021 06:07:00
4  GBP/RUB         NaN  2539  1048631  17.04.2021 06:07:00
5  NOK/RUB         NaN  2539    90651  17.04.2021 06:07:00
6  AUD/RUB         NaN  2604   586662  17.04.2021 06:07:00
7  NZD/RUB         NaN  1488   540879  17.04.2021 06:07:00
8  TRY/RUB         NaN   254    93907  17.04.2021 06:07:00